# Merging & Joining Data

Real data is rarely in one file.

We often combine:<br>
orders + customers<br>
transactions + products<br>

Pandas provides:<br>
merge()<br>
join()<br>
concat()

In [11]:
import pandas as pd

# Load datasets
sales = pd.read_csv("../data/raw/sales.csv")
customers = pd.read_csv("../data/raw/customers.csv")

sales.head()

,order_id,customer_id,product,category,price,quantity,city,date
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07
3,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07
4,1005,C104,Tshirt,Fashion,800,2,Bangalore,2024-01-08

In [12]:
customers.head()

  customer_id           name  age  gender       city
0        C101  Lakshay Bamel   23    Male      Delhi
1        C102    Amit Sharma   25    Male     Mumbai
2        C103     Neha Verma   22  Female       Pune
3        C104     Riya Singh   24  Female  Bangalore
4        C105    Rahul Mehta   28    Male    Chennai

## Inner Merge

Keeps only matching records

In [13]:
# Combine orders with customer info
merged_inner = pd.merge(sales, customers, on="customer_id", how="inner")

merged_inner.head()

,order_id,customer_id,product,category,price,quantity,city_x,date,name,age,gender,city_y
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05,Lakshay Bamel,23,Male,Delhi
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06,Amit Sharma,25,Male,Mumbai
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07,Neha Verma,22,Female,Pune
3,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07,Lakshay Bamel,23,Male,Delhi
4,1005,C104,Tshirt,Fashion,800,2,Bangalore,2024-01-08,Riya Singh,24,Female,Bangalore

## Left Merge

Keeps all rows from left table

In [14]:
merged_left = pd.merge(sales, customers, on="customer_id", how="left")
merged_left.head()

,order_id,customer_id,product,category,price,quantity,city_x,date,name,age,gender,city_y
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05,Lakshay Bamel,23,Male,Delhi
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06,Amit Sharma,25,Male,Mumbai
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07,Neha Verma,22,Female,Pune
3,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07,Lakshay Bamel,23,Male,Delhi
4,1005,C104,Tshirt,Fashion,800,2,Bangalore,2024-01-08,Riya Singh,24,Female,Bangalore

## Right Merge

In [15]:
merged_right = pd.merge(sales, customers, on="customer_id", how="right")
merged_right.head()

,order_id,customer_id,product,category,price,quantity,city_x,date,name,age,gender,city_y
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05,Lakshay Bamel,23,Male,Delhi
1,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07,Lakshay Bamel,23,Male,Delhi
2,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06,Amit Sharma,25,Male,Mumbai
3,1007,C102,Laptop,Electronics,60000,1,Mumbai,2024-01-10,Amit Sharma,25,Male,Mumbai
4,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07,Neha Verma,22,Female,Pune

## Outer Merge

Keeps everything

In [16]:
merged_outer = pd.merge(sales, customers, on="customer_id", how="outer")
merged_outer.head()

,order_id,customer_id,product,category,price,quantity,city_x,date,name,age,gender,city_y
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05,Lakshay Bamel,23,Male,Delhi
1,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07,Lakshay Bamel,23,Male,Delhi
2,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06,Amit Sharma,25,Male,Mumbai
3,1007,C102,Laptop,Electronics,60000,1,Mumbai,2024-01-10,Amit Sharma,25,Male,Mumbai
4,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07,Neha Verma,22,Female,Pune

## Join (index based)

In [17]:
sales_index = sales.set_index("customer_id")
customers_index = customers.set_index("customer_id")

# add suffix to avoid column conflict
sales_index.join(customers_index, lsuffix="_order", rsuffix="_customer")

,order_id,product,category,price,quantity,city_order,date,name,age,gender,city_customer
customer_id,,,,,,,,,,,
C101,1001,Laptop,Electronics,55000,1,Delhi,2024-01-05,Lakshay Bamel,23,Male,Delhi
C102,1002,Phone,Electronics,20000,2,Mumbai,2024-01-06,Amit Sharma,25,Male,Mumbai
C103,1003,Shoes,Fashion,3000,1,Pune,2024-01-07,Neha Verma,22,Female,Pune
C101,1004,Headphones,Electronics,2000,3,Delhi,2024-01-07,Lakshay Bamel,23,Male,Delhi
C104,1005,Tshirt,Fashion,800,2,Bangalore,2024-01-08,Riya Singh,24,Female,Bangalore
C105,1006,Watch,Accessories,2500,1,Chennai,2024-01-09,Rahul Mehta,28,Male,Chennai
C102,1007,Laptop,Electronics,60000,1,Mumbai,2024-01-10,Amit Sharma,25,Male,Mumbai
C106,1008,Backpack,Accessories,1500,2,Delhi,2024-01-10,Simran Kaur,21,Female,Delhi
C103,1009,Phone,Electronics,18000,1,Pune,2024-01-11,Neha Verma,22,Female,Pune
C104,1010,Shoes,Fashion,3500,1,Bangalore,2024-01-11,Riya Singh,24,Female,Bangalore

## Concatenation

In [18]:
# duplicate dataset for demo
sales_part2 = sales.iloc[:3]

pd.concat([sales, sales_part2])

,order_id,customer_id,product,category,price,quantity,city,date
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07
3,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07
4,1005,C104,Tshirt,Fashion,800,2,Bangalore,2024-01-08
5,1006,C105,Watch,Accessories,2500,1,Chennai,2024-01-09
6,1007,C102,Laptop,Electronics,60000,1,Mumbai,2024-01-10
7,1008,C106,Backpack,Accessories,1500,2,Delhi,2024-01-10
8,1009,C103,Phone,Electronics,18000,1,Pune,2024-01-11
9,1010,C104,Shoes,Fashion,3500,1,Bangalore,2024-01-11
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07

## Save Combined Dataset

In [19]:
merged_inner.to_csv("../data/processed/merged_sales_customers.csv", index=False)

## Conclusion

Combining datasets is essential for real-world analysis.